app/controllers/admin/users_controller.rb

  def index
    @users = User.order(:email)
---
SELECT "users".* FROM "users"  ORDER BY "users"."email" ASC

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    if params[:user][:password].blank?
      params[:user].delete(:password)
    end
    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "newguy@example.com"], ["updated_at", "2016-08-18 20:17:11.928286"], ["id", 2]]