app/views/projects/show.html.erb

<ul id="ticket">
  <% @project.tickets.each do |ticket| %>
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = ?  [["project_id", 1]]