app/controllers/projects_controller.rb

UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Sublime Text 4 beta"], ["description", ""], ["updated_at", "2016-08-10 06:43:20.530415"], ["id", 1]]
---
  def update
    @project.update(project_params)