app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("name", "description", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Non-valid compliance"], ["description", "My pages are ugly!"], ["project_id", 1], ["created_at", "2016-08-14 00:00:35.882132"], ["updated_at", "2016-08-14 00:00:35.882132"]]
---
  def create
    @ticket = @project.tickets.build(ticket_params)

    if @ticket.save

UPDATE "tickets" SET "name" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["name", "Make it really shiny!"], ["updated_at", "2016-08-14 18:00:49.544198"], ["id", 1]]
---
  def update
    if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]
---
  def destroy
    @ticket.destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_project
    @project = Project.find(params[:project_id])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."project_id" = ? AND "tickets"."id" = ? LIMIT 1  [["project_id", 1], ["id", 1]]
---
  def set_ticket
    @ticket = @project.tickets.find(params[:id])